[
  {
    "role": "UX/UI Lead",
    "company": "Indegene",
    "summary": "Skilled in Creative Design , Mobile App Design and Responsive Design Expertise in iOS and Android platform Guidelines Ability to Achieve Client Expectation Seasoned professional with 6 years of Experience as Web Designer Responsible for complete Web Designing activities",
    "range": "February 2022 - Present"
  },
  {
    "role": "Sr. Visual Designer",
    "company": "Harman Connected Services",
    "summary": "Skilled in Creative Design , Mobile App Design and Responsive Design Expertise in iOS and Android platform Guidelines Ability to Achieve Client Expectation Seasoned professional with 6 years of Experience as Web Designer Responsible for complete Web Designing activities Gone through the full life cycle development of large projects and played an integral part for creating the Interaction Design. Mood boards to understand the visual design direction required, Visual design and review.",
    "range": "March 2015 - February 2022"
  },
  {
    "role": "Sr. Visual Designer",
    "company": "Photon Interactive Pvt Ltd",
    "summary": "Creating User Interface Designs for Desktop, Mobile and Tabs applications. Expertise in iOS, Android and Windows platform Guidelines Cultivate and articulate creative ideas, then translate them into effective design work that is in alignment with client direction Create detailed wireframes, mock-ups, and user flows, to effectively illustrate interfaces and ideasManaging multiple concurrent projects with effective problem solving mindset",
    "range": "February 2013 - March 2015"
  },
  {
    "role": "Sr.Web Designer",
    "company": "Prabanjan’s Medialab Private Limited",
    "summary": "Produced style guides and web/CSS/interaction specification sheets for engineers.Designed mock-ups for potential and existing clients to show how our applications would look if integrated into their systems. Delivered high quality design docs: sketches, sitemap, user flows, wireframes, mockups, specification.",
    "range": "February 2009 - March 2013"
  },
  {
    "role": "Sr.Web Designer",
    "company": "Black & White Multimedia India Pvt. Ltd.",
    "summary": "Produced style guides and web/CSS/interaction specification sheets for engineers. Designed mock-ups for potential and existing clients to show how our applications would look if integrated into their systems. Delivered high quality design docs: sketches, sitemap, user flows, wireframes, mockups, specification.",
    "range": "February 2004 - March 2009"
  }
]
